app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @current_uri = request.referrer
    byebug
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save