app/views/products/_product.html.erb


  <%if !@current_cart.products.include?(product)%>
---
SELECT 1 AS one FROM "products" INNER JOIN "line_items" ON "products"."id" = "line_items"."product_id" WHERE "line_items"."cart_id" = $1 AND "products"."id" = $2 LIMIT $3  [["cart_id", 2], ["id", 1], ["LIMIT", 1]]

      <!-- reduce -->
      <%=link_to line_item_reduce_path(:id =>@current_cart.line_items.find_by(product_id: product.id)) , method: :post, class: "btn btn-danger" , style: "margin-top:15px;" do %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1 AND "line_items"."product_id" = $2 LIMIT $3  [["cart_id", 4], ["product_id", 13], ["LIMIT", 1]]