app/views/layouts/_header.html.erb

          <span class="badge ">
            <i id="total_cart_items_badge">(<%= User.count %>)</i>
---
SELECT COUNT(*) FROM "users"


          <i id="total_cart_items_badge">(<%= @current_cart.line_items.count %>)</i>
---
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]

        <%if @current_user.admin? %>
          (<%= @current_user.orders.count %>) Admin / (<%= Order.count%>) Total
---
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]